export default function LotteryNameMap(code) {
  const names = {
      'CQSSC': '重庆时时彩',
      'SD11Y': '山东11选5',
      'HLJSSC': '黑龙江时时彩',
      'XJSSC': '新疆时时彩',
      'JS115': '江苏11选5',
      'JX115': '江西11选5',
      'GD115': '广东11选5',
      'TJSSC': '天津时时彩',
      '3D':'福彩3D',
      'P3P5':'体彩P3P5',
      'YZFFC':'幸运分分彩',
      'JSKS':'江苏快三',
      'KSFFC':'快三分分彩',
      'KLPK':'山东快乐扑克',
      'YZMMC':'幸运秒秒彩',
      'FFC115':'11选5分分彩',
      'BJPKS':'北京PK拾',
      'DJ15':'东京1.5分彩',
      'AHKS':'安徽快三',
      'FJKS':'福建快三',
      'LHC':'香港⑥合彩',
      'SSQ':'双色球',
      'XY28':'幸运28',
      'QQFFC':'腾讯分分彩',
      'JSLHC':'极速⑥合彩',
      'XYFT':'幸运飞艇'
  };
  const ids = {
      1:'重庆时时彩',
      2:'山东11选5',
      3:'黑龙江时时彩',
      4:'新疆时时彩',
      5:'江苏11选5',
      6:'江西11选5',
      7:'广东11选5',
      8:'天津时时彩',
      9:'福彩3D',
      10:'体彩P3P5',
      11:'分分彩',
      12:'江苏快三',
      13:'快三分分彩',
      14:'山东快乐扑克',
      15:'幸运秒秒彩',
      16:'11选5分分彩',
      17:'北京PK拾',
      18:'东京1.5分彩',
      19:'安徽快三',
      20:'福建快三',
      21:'香港⑥合彩',
      22:'双色球',
      23:'幸运28',
      24:'腾讯分分彩',
      25:'极速⑥合彩',
      26:'幸运飞艇',
  };

  let name = '-';

  if (isNaN(parseInt(code, 10))) {
    code = code.toUpperCase();
    name = names[code];
  } else {
    name = ids[code];
  }

  return name;
}
